//MARKADDJ JOB (0),'NEW MBR',CLASS=A,MSGCLASS=T
//STEPA EXEC PGM=IEBUPDTE
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=MARK.EXEC,DISP=SHR
//SYSUT2   DD DSN=MARK.EXEC,DISP=SHR
//SYSIN    DD DATA,DLM=ZZ
./ ADD NAME=MDRXCNSL
/* -----------------------------------------------------------
* NOT READY FOR USE
* STILL BUGGY - read on
*
*
* MDRXCNSL
* Purpose: I have never been able to get output from RXCONSOLE
*          so I need this.
*          It's not pretty as I am not great with REXX but it
*          works which is the main thing.
*          BUT This currently only works for console D(isplay)
*          commands (that tag an id).
*
* KNOWN BUGS:
*     Only console display commands are working at the moment.
*     (ie: D A,L works well, nothing else does... )
*     Commands that do not produce much output do not have
*     responses written to the MTT before we try to read them.
* ie: 'f nje38,d nodes' may return nothing, repeat it and there
*     is data there (the previous data, not from the second
*     attempt yet). Thinking, thinking....
*
* Invoke with 
*    rx mdrxcnsl 'console command'
*    or in a rexx script
*      call mdrxcnsl('console command')
*
* Issue a console command
* Use MTT to locate the response data
*
* There could be lots of identical commands issues by the TSU
* session, so we buffer what we find, at every new matching
* find drop the buffer and start buffering the latest found,
* so at the end we should only have the last command output
* to display.
* -----------------------------------------------------------
*/
ARG CMDRQST
IF CMDRQST=="" THEN DO
   SAY "ERROR: NO COMMAND PROVIDED"
   EXIT
END
CALL CONSOLE(CMDRQST)

/* 
* We need to obtain our TSU number so we can locate
* the commands issues by this session.
*/
SINK=JOBINFO()
SAY "DEBUG: MY JOB NUMBER IS " job.number    /* TSU00000 */
NUMONLY=SUBSTR(job.number,4,5)        /* remove TSU part */
TESTCHR="0"                           /* remove leading zeros */
DO WHILE (TESTCHR=="0")
   TESTCHR=SUBSTR(NUMONLY,1,1)
   IF TESTCHR=="0" THEN DO
      NUMONLY=SUBSTR(NUMONLY,2,(LENGTH(NUMONLY)-1))
   END
END

/*
* Could be lots of command matches. Buffer
* the responses, drop if needed, until we
* only have the last response.
*/
RESPCOUNT=0
RESPBUF.0=0

RESPLOC=0   /* are we looking for the ACTIVITY field ? */
ACTID="X"   /* activity is to search for */
RC = MTT()
IF RC > -1 THEN DO
  DO I=1 TO _LINE.0
    IF RESPLOC==0 THEN DO
       /* We are trying to find the line that recorded
          the exact command we entered that was issued
          by this exact TSO session (or exact STC or JOB)
          search for lines like 
          "0000 HH.MM.DD TSU 31 command entered" 
          "0000 HH.MM.DD STC 31 command entered" 
       */
       PARSE VALUE _LINE.I WITH . . XTSU TSUNUM CMDDATA
       /* Goes splat if nothing parsed into those fields */
       IF TSUNUM=="" THEN TSNUM="X"
       IF CMDDATA=="" THEN CMDDATA="X"
       IF XTSU=="" THEN XTSU="X"
       /* line continuation not working, so lots of ifs */
       /* Normally run by a TSU user */
       IF XTSU=="TSU" THEN DO
          IF TSUNUM==NUMONLY THEN DO
             IF CMDDATA==CMDRQST THEN DO
                RESPLOC=1
             END
          END
       END
       /* STCs may run it */
       IF XTSU="STC" THEN DO
          IF TSUNUM==NUMONLY THEN DO
             IF CMDDATA==CMDRQST THEN DO
                RESPLOC=1
             END
          END
       END
       /* Potentially a JOB */
       IF XTSU="JOB" THEN DO
          IF TSUNUM==NUMONLY THEN DO
             IF CMDDATA==CMDRQST THEN DO
                RESPLOC=1
             END
          END
       END
    END
    ELSE DO
       /* We found the command entered, must assume the next line
        * is the one tagged with the command ID number
        * search 0000 HH.MM.DD IEE102I HH.MM.SS YY.DDD ACTIVITY nnn 
        * BUGGER: IEE102I is only for D A commands.
        * Have to just assume the next message in MTT is ours, with 
        * the activity id at the end of it.
        * So get the last word of the message
        * Additional tests, only valid for those commands that
        * write a message containing the activity id at the end
        * so for those starting 0000
        */
       PARSE VALUE _LINE.I WITH XNUM DATA
       IF XMUM=="0000" THEN DO
          w=words(_LINE.I)
          ACTID = word(_LINE.I, max(1, w)) 
          SAY "DEBUG1: looking for tag" ACTID "FROM" _LINE.I
       END
       ELSE DO
          /* If no specific tag we must assume that the next line
           * is part of our response so hope that the first word
           * of that is the activity id tag we need to search on
           */
          J=I+1
          PARSE VALUE _LINE.J WITH XNUM DATA
          /* If the command was to request output from a STC
           * (ie:f nje38,d nodes') the msgs are not tagged
           * to our job number but that of the STC. In most
           * cases these will be tagged FFFF
           *
           * If it is also 0000 we have a problem
           */
          IF XNUM=="0000" THEN DO
             w=words(_LINE.J)
             ACTID = word(_LINE.J, max(1, w)) 
             SAY "DEBUG3: looking for tag" ACTID "FROM" _LINE.J
          END
          ELSE DO
             ACTID=XNUM
          END
          SAY "DEBUG2: looking for tag" ACTID "FROM" _LINE.J
       END
       /* We may have buffered earlier matches. We only want the
        * output of the last match, so drop anything we have
        * already buffered as we are starting again.
        * By earlier matches I mean a TSU user may have entered
        * D A,L multiple times for a single logon session, we do
        * not want them all just the output of the latest one
        */
       IF ACTID!="X" THEN DO
          DROP RESPBUF
          RESPCOUNT=0
          RESPBUF.0=0
          SAY "DBG: DROPPED BUFFER"
       END
       RESPLOC=0
    END

    /* If any messages match the line activity Id then it is a
    *  command from this TSU session, Buffer it.
    */
    PARSE VALUE _LINE.I WITH LID DATA
    IF LID==ACTID THEN DO
       RESPCOUNT=RESPCOUNT+1
       RESPBUF.RESPCOUNT=DATA
       RESPBUF.0=RESPCOUNT
       SAY "DBG: *******" DATA
    END
    ELSE DO 
       IF ACTID=="FFFF" THEN DO
          /* if the end of FFFF lines switch off */
          ACTID="X"
       END
    END
  END
  /*
   * Now display the last responses we buffered
   */
  IF RESPBUF.0 > 0 THEN DO
      DO I=1 TO RESPBUF.0
         SAY RESPBUF.I
      END
  END
  ELSE DO
     SAY "DEBUG: NO RESPONSE DATA FOUND"
  END
END
./ ENDUP
ZZ
//
