//MARKPRO JOB (0),'STORE MACROS',CLASS=A,MSGCLASS=T,
//  USER=MVSUSERN,PASSWORD=MVSPASSW
//*
//* CHANGE SYS9.PROCLIB to one you use.
//*  (Turnkeys will probably use SYS2.PROCLIB)
//*  
//LOAD     EXEC PGM=IEBUPDTE
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD   DSN=SYS9.PROCLIB,DISP=SHR
//SYSUT2   DD   DSN=SYS9.PROCLIB,DISP=SHR
//SYSIN    DD   DATA,DLM=@@
./ ADD NAME=MDCSAMGR
//MDCSAMGR PROC P=''
//TESTIT2  EXEC PGM=MDCSAALC,COND=(0,NE),PARM='&P'
//* P='REQUEST=IPLINIT' TO BE USED ONLY AT IPL TIME
//STEPLIB  DD   DISP=SHR,DSN=MARK.LIB.LOAD.APFAUTH
//SYSUDUMP DD   SYSOUT=*
//SYSABEND DD   SYSOUT=*
./ ENDUP
@@
//
